# Hypothesis Testing Exercises
For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

## Exercise 1
> **Has the network latency gone up since we switched internet service providers?**

**Data**: Average latency before and after we switch
- $H_0$: There is no difference in latency between both providers
- $H_a$: The latency gets shorter after we switch

- **True Positive**
    - small p-value --> the probability of $H_0$ is true is low. 
    - reject $H_0$
    - before switching the average latency is 230ms
    - after switching the average latency is 80ms

- **False Positive**
    - small p-value
    - reject $H-0$
    - before switching the average latency is 230ms
    - after switching the average latency is 80ms
    - We tested latency at different time period, one is at rush hour, the other one is tested at midnight
- **True Negative**
    - higher p -value
    - fail to reject $H_0$
    - before switching the average latency is 230ms
    - after switching the average latency is 200ms
- **False Negative**
    - higher p -value
    - fail to reject $H_0$
    - before switching the average latency is 230ms
    - after switching the average latency is 200ms
    - when testing there are different number of other applications running at the same time

## Exercise 2
> **Is the website redesign any good?**

**Data**: traffic of the website
- $H_0$: there is no difference after the website was redesigned
- $H_a$: there is a  increase in traffic after the website was redesigned

- **True Positive**
    - low p_ value
    - reject $H_0$
    - before redesign, the traffic was 4000 visitors per day
    - after redesign, the traffic is 6000 visitors per day
- **False Positive**
    - low p_ value
    - reject $H_0$
    - before redesign, the traffic was 4000 visitors per day
    - after redesign, the traffic is 6000 visitors per day
    - they somehow increase the quality of the context in the website
- **True Negative**
    - high p-value
    - fail to reject $H_0$
    - before redesign, the traffic was 4000 visitors per day
    - after redesign, the traffic is 4100 visitors per day
- **False Negative**
    - high p-value
    - fail to reject $H_0$
    - before redesign, the traffic was 4000 visitors per day
    - after redesign, the traffic is 4100 visitors per day
    - they add more ads in the website.

## Exercise 3
> Is our television ad driving more sales?

**data**: number of sales
- $H_0$: the number of sales remain the same after the ad is the air
- $H_a$: the number of sales increase after the ad is the air

- **True Positive**
    - low p_ value
    - reject $H_0$
    - before the ad is in the air, the sales was 300 per month
    - after the ad is in the air, the sales is 500 per month
- **False Positive**
    - low p_ value
    - reject $H_0$
    - before the ad is in the air, the sales was 300 per month
    - after the ad is in the air, the sales is 500 per month
    - the manfacture update some feature of the data
- **True Negative**
    - high p-value
    - fail to reject $H_0$
    - before the ad is in the air, the sales was 300 per month
    - after the ad is in the air, the sales is 310 per month
- **False Negative**
    - high p-value
    - fail to reject $H_0$
    - before the ad is in the air, the sales was 300 per month
    - after the ad is in the air, the sales is 310 per month
    - some salse person quit their jobs.

## Mini Exercise 1 
> Are the average grades in web development vs data science classes different?

**Data**: average grades
- $H_0$: there is no difference between two classes
- $H_a$: data science class has higher average grades than web development class.

- **True Positive**
    - low p_ value
    - reject $H_0$
    - the average grade for data science is 90
    - the average grade for data science is 83
- **False Positive**
    - low p_ value
    - reject $H_0$
    - the average grade for data science is 90
    - the average grade for data science is 83
    - the there are more students in data science has a college degree
- **True Negative**
    - high p-value
    - fail to reject $H_0$
    - the average grade for data science is 95
    - the average grade for data science is 83
- **False Negative**
    - high p-value
    - fail to reject $H_0$
    - the average grade for data science is 95
    - the average grade for data science is 83
    - some of the students from data science skipped class for several times

## Mini Exercise 2
> Is there a relationship between how early a student shows up to class and their grade?

**Data**: average grades and time they showup before class begin
- $H_0$: there is no difference between students showup early and student show up late
- $H_a$: students showup earler has higher grades than students showup late

- **True Positive**
    - low p_ value
    - reject $H_0$
    - the average grade for student showup 15 mins earlier is 90
    - the average grade for student showup not 15 mins earlier is 82
- **False Positive**
    - low p_ value
    - reject $H_0$
    - the average grade for student showup 15 mins earlier is 90
    - the average grade for student showup not 15 mins earlier is 82
    - some students showup early study extra hours after school.
- **True Negative**
    - high p-value
    - fail to reject $H_0$
    - the average grade for student showup 15 mins earlier is 90
    - the average grade for student showup not 15 mins earlier is 89
- **False Negative**
    - high p-value
    - fail to reject $H_0$
    - the average grade for student showup 15 mins earlier is 90
    - the average grade for student showup not 15 mins earlier is 89
    - some students showup late study extra hours after school

## Mini Exercise 3
> Are web dev or data science students more likely to be coffee drinkers?

**Data**: average coffee comsumption between two classes
- $H_0$: there is no difference between two classes
- $H_a$: data science class drink more coffee than web development class.

- **True Positive**
    - low p_ value
    - reject $H_0$
    - the average coffee consumption for data science is 2 cups per person
    - the average coffee consumption for wed development is 4 cups per person
- **False Positive**
    - low p_ value
    - reject $H_0$
    - the average coffee consumption for data science is 2 cups per person
    - the average coffee consumption for wed development is 4 cups per person
    - the web develpment class is closer to the coffee machine
- **True Negative**
    - high p-value
    - fail to reject $H_0$
    - the average coffee consumption for data science is 3 cups per person
    - the average coffee consumption for wed development is 3.5 cups per person
- **False Negative**
    - high p-value
    - fail to reject $H_0$
    - the average coffee consumption for data science is 3 cups per person
    - the average coffee consumption for wed development is 3.5 cups per person
    - some student of the web develpment buy coffee from the barkery downstairs

# T -test Exercises

In [60]:
import pandas as pd 
import numpy as np
from scipy import stats
from math import sqrt

## Exercise 1 
Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

- $H_0$: There is no difference in average time to sell homes for boths offices
- $H_a$: There is a dfference in average time to sell homes for boths offices

In [18]:
alpha = .05
x1 = stats.norm(90, 15).rvs(40)
x2 = stats.norm(100, 20).rvs(50)
xbar1 = x1.mean()
xbar2 = x2.mean()

n1 = x1.shape[0]
n2 = x2.shape[0]

s1 = x1.std()
s2 = x2.std()

degf = (n1 + n2) - 2 # n - number of categories

s_p = sqrt(
    ((n1 - 1) * s1**2 + (n2 - 1) * s2**2)
    /
    (n1 + n2 - 2)
)

t = (xbar1 - xbar2) / (s_p * sqrt(1 / n1 + 1 / n2))

In [19]:
t

-2.9981371440307303

In [55]:
p = stats.t(degf).cdf(t) * 2
p

0.003530656898974799

In [21]:
stats.ttest_ind(x1, x2)

Ttest_indResult(statistic=-2.96615582146002, pvalue=0.00388153419236683)

In [39]:
print(f'''
Because p({p:.4f}) > alpha({alpha}), so We  reject $H_0$, There is a difference for two offices of their 
average time selling houses.)  
''')

Because p(0.5709) > alpha(0.05), so We  reject $H_0$, There is a difference for two offices of their
average time selling houses.)

## Exercise 2
Load the mpg dataset and use it to answer the following questions:

In [37]:
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

1. Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

- $H_0$: There is no difference in fuel-efficiency in cars from 2008 vs 1999

In [35]:
x1 = mpg[mpg.year == 1999].cty
x2 = mpg[mpg.year == 2008].cty
stats.ttest_ind(x1, x2)
s_stat, p = stats.ttest_ind(x1, x2)

In [56]:
print(f'''
Because p({p:.4f}) > alpha({alpha}), so We reject $H_0$, There is no
difference in fuel-efficiency in cars from 2008 vs 1999.)  
''')

Because p(0.0035) > alpha(0.05), so We reject $H_0$, There is no
difference in fuel-efficiency in cars from 2008 vs 1999.)

2. Are compact cars more fuel-efficient than the average car?

- $H_0$: There is no difference in fuel-efficiency from compact cars and all the cars

In [43]:
x = mpg[mpg['class'] == 'compact'].cty
mu = mpg.cty.mean()
t_stat, p = stats.ttest_1samp(x, mu)

print(f't = {t_stat:.3}')
print(f'p = {p:.3}')

t = 6.62
p = 3.4e-08

In [47]:
print(f'''
Because p({p:.8f}) < alpha({alpha}), so We reject $H_0$, There is no
difference in fuel-efficiency in cars from 2008 vs 1999.)  
''')

Because p(0.00000003) < alpha(0.05), so We reject $H_0$, There is no
difference in fuel-efficiency in cars from 2008 vs 1999.)

3. Do manual cars get better gas mileage than automatic cars?

- $H_0$: There is no difference in fuel-efficiency in cars with auto transmission and manual transmission

In [53]:
x1 = mpg[mpg.trans.str.contains('auto')].cty
x2 = mpg[mpg.trans.str.contains('manual')].cty
t_stat, p = stats.ttest_1samp(x, mu)

print(f't = {t_stat:.3}')
print(f'p = {p:.3}')

t = 6.62
p = 3.4e-08

In [54]:
print(f'''
Because p({p:.8f}) < alpha({alpha}), so We reject $H_0$, There is a huge 
difference in fuel-efficiency in cars from 2008 vs 1999.)  
''')

Because p(0.00000003) < alpha(0.05), so We reject $H_0$, There is a huge
difference in fuel-efficiency in cars from 2008 vs 1999.)

# Correlation Exercises

## Exercise 1
Use the telco_churn data. Does tenure correlate with monthly charges? Total charges? What happens if you control for phone and internet service?

In [252]:
def get_db_url(db_name):
    from env import host, user, password
    url = f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    return url
query = ('''
    SELECT  tenure, monthly_charges, total_charges, phone_service, internet_service_type_id, churn
    FROM customers 
    ''')
telco_churn = pd.read_sql(query, get_db_url("telco_churn"))
telco_churn.sample(10)

,tenure,monthly_charges,total_charges,phone_service,internet_service_type_id,churn
807,28,90.45,2509.25,Yes,2,No
2363,5,94.85,462.8,Yes,2,Yes
6153,61,103.30,6518.35,Yes,2,No
3236,9,88.40,788.6,Yes,2,No
4408,22,55.15,1206.05,Yes,1,Yes
4903,72,117.35,8436.25,Yes,2,No
6804,45,115.65,5125.5,Yes,2,No
4089,9,59.50,530.05,Yes,1,No
335,1,79.70,79.7,Yes,2,Yes
4679,47,109.55,5124.55,Yes,2,Yes

In [254]:
#drop the bad data from total changes and change it to float
telco_churn = telco_churn.sort_values(by='total_charges')
telco_churn = telco_churn.iloc[11:]
telco_churn.total_charges = telco_churn.total_charges.astype("float")

In [255]:
#tenure vs monthly_charges
x = telco_churn.monthly_charges
y = telco_churn.tenure
r, p = stats.pearsonr(x, y)
print('r=', r)
print('p=', p)

r= 0.24688016466672574
p= 5.453865695034659e-98

In [256]:
#tenure vs total_charges
x = telco_churn.total_charges
y = telco_churn.tenure
r, p = stats.pearsonr(x, y)
print('r=', r)
print('p=', p)

r= 0.8256673261387772
p= 0.0

In [250]:
df1 = telco_churn[(telco_churn.phone_service == 'Yes') & (telco_churn.internet_service_type_id == 1)]

,tenure,monthly_charges,total_charges,phone_service,internet_service_type_id,churn
4465,19,58.20,1045.25,Yes,1,No
5895,19,55.00,1046.50,Yes,1,Yes
3870,22,49.80,1049.05,Yes,1,No
3815,2,45.85,105.60,Yes,1,No
5429,22,48.80,1054.60,Yes,1,Yes
...,...,...,...,...,...,...
1461,13,75.30,989.45,Yes,1,Yes
3287,18,57.45,990.85,Yes,1,Yes
3133,18,57.65,992.70,Yes,1,No
5284,15,64.65,994.55,Yes,1,Yes
2065,13,78.75,995.35,Yes,1,No

## Exercise 2
Use the employees database.
- Is there a relationship between how long an employee has been with the company and their salary?
- Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [273]:
def get_db_url(db_name):
    from env import host, user, password
    url = f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    return url
query = ('''
SELECT emp_no, salary, YEAR(from_date) AS start_year, YEAR(to_date) AS end_year
FROM salaries
LIMIT 1500
    ''')
salaries = pd.read_sql(query, get_db_url("employees"))
salaries.head()

   emp_no  salary  start_year  end_year
0   10001   60117        1986      1987
1   10001   62102        1987      1988
2   10001   66074        1988      1989
3   10001   66596        1989      1990
4   10001   66961        1990      1991

In [275]:
#fix the max exit_year to the lateset year other the 9999 from the table
max_year = salaries[salaries.end_year != salaries.end_year.max()].end_year.max()
salaries.end_year = np.where(salaries.end_year == salaries.end_year.max(), max_year, salaries.end_year)

In [288]:
# Check if each row represent 1 year
((salaries.end_year - salaries.start_year) >1).sum()

0

In [294]:
#Groupby the emp_no and make a new df
df1 = salaries.groupby('emp_no').salary.agg(['max', 'count']).reset_index()
df1 = df1.rename(columns = {'max': 'max_salary', 'count': "years"})
df1.head()

   emp_no  max_salary  years
0   10001       88958     17
1   10002       72527      6
2   10003       43699      7
3   10004       74057     16
4   10005       94692     13

In [296]:
x = df1.years
y = df1.max_salary
r, p = stats.pearsonr(x, y)
print('r=', r)
print('p=', p)

r= 0.4719908912812197
p= 4.970459997270106e-10

In [204]:
salaries = salaries.reset_index()
salaries.emp_no.max()

10101

In [206]:
query = '''SELECT *
FROM titles 
WHERE emp_no <= 10101
'''
titles = pd.read_sql(query, get_db_url("employees"))
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [211]:
title_counts = titles.groupby('emp_no').title.count()
df = pd.merge(salaries, title_counts, left_on='emp_no', right_on='emp_no', how='left')

In [215]:
employee = df[['emp_no', 'years', 'title']]

In [216]:
x = employee.years
y = employee.title
r, p = stats.pearsonr(x, y)
print('r=', r)
print('p=', p)

r= 0.5216634352980877
p= 2.22014735345215e-08

## Exercise 3
Use the sleepstudy data. Is there a relationship between days and reaction time?

In [217]:
from pydataset import data

In [226]:
sleep_study = data("sleepstudy")
sleep_study.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

In [232]:
df = sleep_study.groupby('Days').Reaction.mean()
df = df.reset_index()
df

   Days    Reaction
0     0  256.651806
1     1  264.495756
2     2  265.361900
3     3  282.992011
4     4  288.649422
5     5  308.518456
6     6  312.178256
7     7  318.750583
8     8  336.629506
9     9  350.851222

In [233]:
x = df.Days
y = df.Reaction
r, p = stats.pearsonr(x, y)
print('r=', r)
print('p=', p)

r= 0.9893180251905147
p= 5.623495872574426e-08